---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.StairsStringerCannotBeCreated
source: html/eda2a791-4c5b-2ec6-6c6d-fe893a693e40.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.StairsStringerCannotBeCreated Property

The stairs stringer cannot be created.

## Syntax (C#)
```csharp
public static FailureDefinitionId StairsStringerCannotBeCreated { get; }
```